In [10]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 24],
    'City': ['New York', 'Boston', 'Chicago', 'Rome']
})
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    Boston
2  Charlie   35   Chicago
3    David   24      Rome

In [17]:
df2 = pd.DataFrame(
    columns=["Name", "Age", "City"],
    data=[
        ["Alice", 25, "New York"],
        ["Bob", 30, "Boston"],
        ["Charlie", 35, "Chicago"],
        ["David", 24, "Rome"],
    ],
)
df2

      Name  Age      City
0    Alice   25  New York
1      Bob   30    Boston
2  Charlie   35   Chicago
3    David   24      Rome

In [19]:
print("Are df and df2 equal?", (df == df2).all().all())

Are df and df2 equal? True

In [ ]:
# Selects all record's ages
df["Age"].to_list()

[25, 30, 35, 24]

In [ ]:
# Selects all cities inside of df and df2
df["City"].to_list() == df2["City"].to_list()

True

In [ ]:
# iloc returns the record at index i
df.iloc[0]["Name"]

'Alice'

In [35]:
# when used with index -1, it returns the last record
df.iloc[-1]["Name"]

'David'